<a href="https://colab.research.google.com/github/Sateesh110/Rep_ML/blob/master/zFE_Unique_Values.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# FE

## Import Packages

In [2]:
import numpy as np
import pandas as pd

##Source Data

In [3]:
data = pd.read_csv('https://www.openml.org/data/get_csv/16826755/phpMYEkMl')
data.head(3)

   pclass  survived  ... body                        home.dest
0       1         1  ...    ?                     St Louis, MO
1       1         1  ...    ?  Montreal, PQ / Chesterville, ON
2       1         0  ...    ?  Montreal, PQ / Chesterville, ON

[3 rows x 14 columns]

## String Replace

In [4]:
df = data.replace("?",np.nan)
df2 = df.copy()
df.head(3)

   pclass  survived  ... body                        home.dest
0       1         1  ...  NaN                     St Louis, MO
1       1         1  ...  NaN  Montreal, PQ / Chesterville, ON
2       1         0  ...  NaN  Montreal, PQ / Chesterville, ON

[3 rows x 14 columns]

## Column Extract

In [5]:
def get_first_cabin(row):
    try:
        return row.split()[0]
    except:
        return np.nan

In [6]:
df['cabin'] = df['cabin'].apply(get_first_cabin)
df.head(3)

   pclass  survived  ... body                        home.dest
0       1         1  ...  NaN                     St Louis, MO
1       1         1  ...  NaN  Montreal, PQ / Chesterville, ON
2       1         0  ...  NaN  Montreal, PQ / Chesterville, ON

[3 rows x 14 columns]

## Column Split

In [11]:
df2[['Cabib_A', 'Cabin_B']] = df2['cabin'].str.split(' ', 1, expand=True)
df2.head(3)

   pclass  survived  ... Cabib_A Cabin_B
0       1         1  ...      B5    None
1       1         1  ...     C22     C26
2       1         0  ...     C22     C26

[3 rows x 16 columns]

##Unique Values

In [15]:
#Unique Values
df['sex'].unique()

array(['female', 'male'], dtype=object)

In [16]:
#Uniues values count
df['sex'].nunique()

2

In [19]:
#Unique Values count two columns
df[['sex','cabin']].nunique()

sex        2
cabin    181
dtype: int64

In [20]:
#Unique values for entire table 
col = df.columns
df[col].nunique()

pclass          3
survived        2
name         1307
sex             2
age            98
sibsp           7
parch           8
ticket        929
fare          281
cabin         181
embarked        3
boat           27
body          121
home.dest     369
dtype: int64

In [22]:
# Number of records for each unqiue values
df['sex'].value_counts()

male      843
female    466
Name: sex, dtype: int64

In [29]:
# Number of records for column combination
df[['survived','sex']].value_counts()

survived  sex
0         male      682
1         female    339
          male      161
0         female    127
dtype: int64

In [30]:
# Number of records for column combination
df[['sex','survived']].value_counts()

sex     survived
male    0           682
female  1           339
male    1           161
female  0           127
dtype: int64

##Missing Values

In [38]:
# Number of missing values
df['age'].isnull().sum()

263

In [37]:
# Number of missing values in each column
df.isnull().sum()

pclass          0
survived        0
name            0
sex             0
age           263
sibsp           0
parch           0
ticket          0
fare            1
cabin        1014
embarked        2
boat          823
body         1188
home.dest     564
dtype: int64

In [39]:
#Pecentange of missing values 
df.isnull().mean()*100

pclass        0.000000
survived      0.000000
name          0.000000
sex           0.000000
age          20.091673
sibsp         0.000000
parch         0.000000
ticket        0.000000
fare          0.076394
cabin        77.463713
embarked      0.152788
boat         62.872422
body         90.756303
home.dest    43.086325
dtype: float64